UAS_Web2_312410430_Rizky/backend-api/app/Config/Routes.php

$routes->resource('barang');
$routes->post('login', 'Auth::login');
$routes->options('(:any)', 'Home::index');
$routes->get('buat-akun-baru', function () {
    $model = new \App\Models\UserModel();
    $data = [
        'nama' => 'Rizky Maulana',
        'email' => 'rizky@admin.com',
        'password' => password_hash('123456', PASSWORD_DEFAULT),
        'role' => 'admin'
    ];
    $model->insert($data);
    return 'Berhasil! Akun rizky@admin.com dengan password 123456 telah ditambahkan ke database.';
});
---
INSERT INTO `users` (`nama`, `email`, `password`, `role`, `created_at`) VALUES ('Rizky Maulana', 'rizky@admin.com', '$2y$10$k/Tb8JNSYAa9nv3qCmeMg.3zbWfIydrZ3TE4g79ocr2HRG/EMSdJu', 'admin', '2026-06-14 17:38:25')