UAS_Web2_312410430_Rizky/backend-api/app/Controllers/Auth.php

    public function login()
    {
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'rizky@admin.com'
 LIMIT 1